print("اهلا وسهلابك في جزيرتي")
الاختيار=input("امامك بابين باب احمر وباب ازرق اي البابين سوف تختار؟")
if الاختيار=="احمر":
    print("رائع!!!! انت الان داخل الغرفه \n امامك ثلاث صناديق ابيض و اسود و اخضر")
    الاختيار1=input("اي الصناديق سوف تختار؟")
    if الاختيار=="ابيض":
        print("لقد فتحت صنوق مليئ بالثعابين\nالعب مره اخرىط")
    elif الاختيار=="اسود":
        print("لقد فتحت صندوق مليئ بالعناكب\nالعب مره اخرى")
    elif الاختيار=="اخضر":
        print("لقد ربحت الذهب")
    else:
        print("اختيار خاطئ")
else:
    print("الادخال خاطئ")
    